//--------------------------------------------------
// file   | Connected.cpp
// date   | 2021/11/07
// anthor | syalpon
//--------------------------------------------------
//Include Files
//--------------------------------------------------
#include "Connected.h"

//--------------------------------------------------
//Global variables
//--------------------------------------------------

//--------------------------------------------------
//Local variables
//--------------------------------------------------

//--------------------------------------------------
//Functions
//--------------------------------------------------
//-----------------
//コンストラクタ
//-----------------
Connected::Connected()
{
    Rename("Connected");
}

//-----------------
//入力電圧変化時に呼び出されるメソッド
//-----------------
VD Connected::InputVoltageTriger(Destination *destination)
{
    // No Process
}

//-----------------
//接続時に呼び出されるメソッド
//-----------------
VD Connected::ConnectTriger(Destination *destination)
{

}
